package main

// 全局变量
var (
	gameMap = [][]int{
		{1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1},
		{1, 0, 209, 0, 1, 0, 27, 0, 0, 1, 0, 31, 1},
		{1, 31, 1, 31, 1, 31, 1, 1, 211, 0, 212, 1, 1},
		{1, 27, 1, 0, 210, 0, 0, 1, 31, 1, 0, 28, 1},
		{1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1},
		{1, 28, 1, 213, 0, 0, 211, 1, 82, 27, 0, 210, 1},
		{1, 0, 1, 0, 1, 1, 31, 0, 0, 1, 1, 31, 1},
		{1, 0, 212, 0, 81, 0, 1, 0, 31, 0, 211, 31, 1},
		{1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 21, 1, 1},
		{1, 31, 0, 0, 0, 210, 0, 22, 1, 0, 212, 0, 1},
		{1, 1, 213, 1, 1, 1, 209, 1, 1, 0, 1, 0, 1},
		{1, 28, 31, 1, 0, 31, 0, 0, 0, 82, 0, 27, 1},
		{1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1},
		{1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1},
		{1, 0, 0, 210, 0, 213, 0, 0, 1, 213, 0, 27, 1},
		{1, 31, 1, 27, 1, 1, 1, 31, 1, 0, 1, 1, 1},
		{1, 1, 1, 0, 1, 0, 0, 0, 210, 0, 0, 28, 1},
		{1, 31, 1, 82, 21, 211, 1, 1, 1, 1, 1, 212, 1},
		{1, 31, 212, 0, 1, 0, 0, 31, 0, 1, 31, 0, 1},
		{1, 81, 1, 0, 1, 0, 31, 1, 212, 0, 0, 211, 27},
		{1, 31, 0, 211, 1, 210, 1, 1, 0, 1, 1, 0, 1},
		{1, 0, 1, 0, 1, 0, 31, 1, 0, 1, 0, 209, 1},
		{1, 28, 1, 0, 209, 0, 0, 0, 211, 0, 213, 0, 1},
		{1, 0, 1, 0, 1, 1, 81, 1, 1, 1, 0, 31, 1},
		{1, 210, 0, 82, 0, 0, 0, 0, 0, 1, 31, 28, 1},
		{1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1},
	}

	treasureMap = map[int]*Treasure{
		27: {Type: treasureATK, Value: 1},
		28: {Type: treasureDEF, Value: 1},
		31: {Type: treasureHP, Value: 50},
		21: {Type: treasureYellowKey, Value: 1},
		22: {Type: treasureBlueKey, Value: 1},
	}

	monsterMap = map[int]*Monster{
		201: {HP: 48, ATK: 18, DEF: 2, Money: 2},
		202: {HP: 42, ATK: 25, DEF: 1, Money: 3},
		203: {HP: 57, ATK: 16, DEF: 1, Money: 2},
		204: {HP: 44, ATK: 30, DEF: 0, Money: 4},
		205: {HP: 36, ATK: 23, DEF: 4, Money: 3},
		206: {HP: 31, ATK: 33, DEF: 3, Money: 4},
		209: {HP: 50, ATK: 28, DEF: 0, Money: 3},
		210: {HP: 28, ATK: 41, DEF: 1, Money: 3},
		211: {HP: 36, ATK: 36, DEF: 2, Money: 4},
		212: {HP: 45, ATK: 25, DEF: 4, Money: 3},
		213: {HP: 39, ATK: 22, DEF: 2, Money: 2},
		214: {HP: 166, ATK: 17, DEF: 12, Money: 0},
		81:  {HP: 1}, // 黄门视作怪物
		82:  {HP: 1}, // 蓝门视作怪物
	}

	start      = [2]int{24, 6}
	end        = [2]int{0, 6}
	initialAtk = int8(10)   // 初始攻击力
	initialDef = int8(6)    // 初始防御力
	initialHP  = int16(230) // 初始生命值
	initialYK  = int8(1)    // 初始黄钥匙
	initialBK  = int8(1)    // 初始蓝钥匙

	requiredATK        = int8(18) // 需要的攻击力
	requiredDEF        = int8(13) // 需要的防御力
	requiredYellowKeys = int8(0)
	requiredBlueKeys   = int8(0)

	damageCache = make(map[int8]map[int8]map[int]int16)
)
